# Total Energy Consumptions Queries

* Queries for total energy consumption data for California, US, North America, and one other continent.
* Saves data into dataframes and then into CSV files for later use in analysis.

## Endpoint References
### Total Energy Consumption, California
* Total Energy Consumption in All Sectors, California
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.TETCB.CA.A`
* Total Energy Consumption in All Petroleum, California
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.PATCB.CA.A`
* Total Energy Consumption in Coal, California
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.CLTCB.CA.A`
* Total Energy Consumption in Natural Gas, California
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.NGTCB.CA.A`

### Total Energy Consumption, United States
* Total Energy Consumption in All Sectors, United States
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.TETCB.US.A`
* Total Energy Consumption in All Petroleum, United States
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.PATCB.US.A`
* Total Energy Consumption in Coal, United States
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.CLTCB.US.A`
* Total Energy Consumption in Natural Gas, United States
    * `http://api.eia.gov/series/?api_key=YOUR_API_KEY_HERE&series_id=SEDS.NGTCB.US.A`

## Imports

In [1]:
import requests
import json
import pandas as pd

from config import eia_api_key

query = 'http://api.eia.gov/series/?api_key='

#### Function to automate reading in values into lists.

In [2]:
def query_to_list(years,value,json):
    for item in json:
        years.append(item[0])
        value.append(item[1])
    print("query_to_list() successful")

## Queries and storing data into individual pandas dataframes.

#### Total Energy Consumption in All Sectors, California

In [3]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.TETCB.CA.A')
    print(response)
except:
    print('Query failed.')

TETCB_CA_A_YEARS = []
TETCB_CA_A_VALUE = []

query_to_list(TETCB_CA_A_YEARS, TETCB_CA_A_VALUE, response.json()['series'][0]['data'])

TETCB_CA = pd.DataFrame({'Years':TETCB_CA_A_YEARS,'TETCB_CA':TETCB_CA_A_VALUE})
TETCB_CA.head()

<Response [200]>
query_to_list() successful

  Years  TETCB_CA
0  2017   7881348
1  2016   7819232
2  2015   7672710
3  2014   7584837
4  2013   7638003

#### Total Energy Consumption in All Petroleum, California

In [4]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.PATCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
PATCB_CA_A_YEARS = []
PATCB_CA_A_VALUE = []

query_to_list(PATCB_CA_A_YEARS, PATCB_CA_A_VALUE, response.json()['series'][0]['data'])

PATCB_CA = pd.DataFrame({'Years':PATCB_CA_A_YEARS,'PATCB_CA':PATCB_CA_A_VALUE})
PATCB_CA.head()

<Response [200]>
query_to_list() successful

  Years  PATCB_CA
0  2017   3666908
1  2016   3602810
2  2015   3494378
3  2014   3363800
4  2013   3352775

#### Total Energy Consumption in Coal, California

In [5]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.CLTCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
CLTCB_CA_A_YEARS = []
CLTCB_CA_A_VALUE = []

query_to_list(CLTCB_CA_A_YEARS, CLTCB_CA_A_VALUE, response.json()['series'][0]['data'])

CLTCB_CA = pd.DataFrame({'Years':CLTCB_CA_A_YEARS,'CLTCB_CA':CLTCB_CA_A_VALUE})
CLTCB_CA.head()

<Response [200]>
query_to_list() successful

  Years  CLTCB_CA
0  2017     33663
1  2016     32077
2  2015     30967
3  2014     39486
4  2013     38151

#### Total Energy Consumption in Natural Gas, California

In [6]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.NGTCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
NGTCB_CA_A_YEARS = []
NGTCB_CA_A_VALUE = []

query_to_list(NGTCB_CA_A_YEARS, NGTCB_CA_A_VALUE, response.json()['series'][0]['data'])

NGTCB_CA = pd.DataFrame({'Years':NGTCB_CA_A_YEARS,'NGTCB_CA':NGTCB_CA_A_VALUE})
NGTCB_CA.head()

<Response [200]>
query_to_list() successful

  Years  NGTCB_CA
0  2017   2188659
1  2016   2248939
2  2015   2384061
3  2014   2409574
4  2013   2480792

#### Total Energy Consumption in All Sectors, United States

In [7]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.TETCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
TETCB_US_A_YEARS = []
TETCB_US_A_VALUE = []

query_to_list(TETCB_US_A_YEARS, TETCB_US_A_VALUE, response.json()['series'][0]['data'])

TETCB_US = pd.DataFrame({'Years':TETCB_US_A_YEARS,'TETCB_US':TETCB_US_A_VALUE})
TETCB_US.head()

<Response [200]>
query_to_list() successful

  Years  TETCB_US
0  2017   7881348
1  2016   7819232
2  2015   7672710
3  2014   7584837
4  2013   7638003

#### Total Energy Consumption in All Petroleum, United States

In [8]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.PATCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
PATCB_US_A_YEARS = []
PATCB_US_A_VALUE = []

query_to_list(PATCB_US_A_YEARS, PATCB_US_A_VALUE, response.json()['series'][0]['data'])

PATCB_US = pd.DataFrame({'Years':PATCB_US_A_YEARS,'PATCB_US':PATCB_US_A_VALUE})
PATCB_US.head()

<Response [200]>
query_to_list() successful

  Years  PATCB_US
0  2017   3666908
1  2016   3602810
2  2015   3494378
3  2014   3363800
4  2013   3352775

#### Total Energy Consumption in Coal, California

In [9]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.CLTCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
CLTCB_US_A_YEARS = []
CLTCB_US_A_VALUE = []

query_to_list(CLTCB_US_A_YEARS, CLTCB_US_A_VALUE, response.json()['series'][0]['data'])

CLTCB_US = pd.DataFrame({'Years':CLTCB_US_A_YEARS,'CLTCB_US':CLTCB_US_A_VALUE})
CLTCB_US.head()

<Response [200]>
query_to_list() successful

  Years  CLTCB_US
0  2017     33663
1  2016     32077
2  2015     30967
3  2014     39486
4  2013     38151

#### Total Energy Consumption in Natural Gas, California

In [10]:
try:
    response = requests.get(query + eia_api_key + '&series_id=SEDS.NGTCB.CA.A')
    print(response)
except:
    print('Query failed.')
    
NGTCB_US_A_YEARS = []
NGTCB_US_A_VALUE = []

query_to_list(NGTCB_US_A_YEARS, NGTCB_US_A_VALUE, response.json()['series'][0]['data'])

NGTCB_US = pd.DataFrame({'Years':NGTCB_US_A_YEARS,'NGTCB_US':NGTCB_US_A_VALUE})
NGTCB_US.head()

<Response [200]>
query_to_list() successful

  Years  NGTCB_US
0  2017   2188659
1  2016   2248939
2  2015   2384061
3  2014   2409574
4  2013   2480792

## Merging all dataframes into one

### Merged California Data

In [11]:
TEC_CA = TETCB_CA.copy()
TEC_CA = TEC_CA.merge(PATCB_CA,how='left')
TEC_CA = TEC_CA.merge(CLTCB_CA,how='left')
TEC_CA = TEC_CA.merge(NGTCB_CA,how='left')
TEC_CA.head()

  Years  TETCB_CA  PATCB_CA  CLTCB_CA  NGTCB_CA
0  2017   7881348   3666908     33663   2188659
1  2016   7819232   3602810     32077   2248939
2  2015   7672710   3494378     30967   2384061
3  2014   7584837   3363800     39486   2409574
4  2013   7638003   3352775     38151   2480792

### Merged United States Data

In [12]:
TEC_US = TETCB_US.copy()
TEC_US = TEC_US.merge(PATCB_US,how='left')
TEC_US = TEC_US.merge(CLTCB_US,how='left')
TEC_US = TEC_US.merge(NGTCB_US,how='left')
TEC_US.head()

  Years  TETCB_US  PATCB_US  CLTCB_US  NGTCB_US
0  2017   7881348   3666908     33663   2188659
1  2016   7819232   3602810     32077   2248939
2  2015   7672710   3494378     30967   2384061
3  2014   7584837   3363800     39486   2409574
4  2013   7638003   3352775     38151   2480792

### Save CSV to Resources folder

In [13]:
TEC_CA.to_csv('../Resources/TotalEnergyConsumption_CA.csv')
TEC_US.to_csv('../Resources/TotalEnergyConsumption_US.csv')